# LengthPerArea Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FillPattern..::..LengthPerArea Property
FillPattern Class See Also
---
Gets length of all lines that placed on unit area.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double LengthPerArea { get; }
```

Visual Basic
---
```text
Public ReadOnly Property LengthPerArea As Double
	Get
```

Visual C++
---
```text
public:
property double LengthPerArea {
	double get ();
}
```

# See Also
FillPattern Class
Autodesk.Revit.DB Namespace